rule Okta_Abnromal_MFA_Events_Detetcted {
  // This rule matches single events. Rules can also match multiple events within

  meta:
    // Allows for storage of arbitrary key-value pairs of rule details - who
    // wrote it, what it detects on, version control, etc.
    // The "author" and "severity" fields are special, as they are used as
    // columns on the rules dashboard. If you'd like to be able to sort based on
    // these fields on the dashboard, make sure to add them here.
    // Severity value, by convention, should be "Low", "Medium" or "High"
    author = "Shyama-Prasad"
    description = "This rule detcts suspicous MFA(Multi Factor Authentication) Events based on Okta logs"
    severity = "Medium"

events:
 
 
$e.metadata.product_name = "Okta"
$e.metadata.product_event_type="user.mfa.factor.update" or
$e.metadata.product_event_type = "system.mfa.factor.deactivate" or
$e.metadata.product_event_type = "user.mfa.factor.deactivate" or
$e.metadata.product_event_type = "user.mfa.attempt_bypass" or
$e.metadata.product_event_type = "user.mfa.factor.reset_all"
$e.security_result.action = "ALLOW"
(
$e.security_result.detection_fields["New Device"] = "POSITIVE" or
$e.security_result.detection_fields["New IP"] = "POSITIVE" // Fine tuned the suspicous events pertatining from NEW IP address or New Device using additional Okta logs 
)
$e.principal.user.userid = $user
 

match :

$user over 15m


condition:
    $e 
}
