rule Okta_Abnromal_MFA_Events_Detetcted {

  meta:
    author = "Shyama-Prasad"
    description = "This rule detects suspicous MFA(Multi Factor Authentication) Events based on Okta logs"
    severity = "Medium"

events:
 
 
$e.metadata.product_name = "Okta"
$e.metadata.product_event_type="user.mfa.factor.update" or
$e.metadata.product_event_type = "system.mfa.factor.deactivate" or
$e.metadata.product_event_type = "user.mfa.factor.deactivate" or
$e.metadata.product_event_type = "user.mfa.attempt_bypass" or
$e.metadata.product_event_type = "user.mfa.factor.reset_all"
$e.security_result.action = "ALLOW"
(
$e.security_result.detection_fields["New Device"] = "POSITIVE" or
$e.security_result.detection_fields["New IP"] = "POSITIVE" // Fine tuned the suspicous events pertatining from NEW IP address or New Device using additional Okta logs 
)
$e.principal.user.userid = $user
 

match :

$user over 15m


condition:
    $e 
}
