  rule Okta_Rare_MFA_Events_Detetcted {

  meta:
    author = "Shyama-Prasad"
    name: "Rare MFA Operations"
    description = "This query checks for rare MFA operations like deactivation, update, reset, and bypass attempts often used by adversaries to compromise networks/accounts"
    severity = "Medium"
    MITRE Tactics = "Persistence-T1098"
    log source = "Okta"

events:
 
$e.metadata.product_name = "Okta"
$e.metadata.product_event_type="user.mfa.factor.update" or
$e.metadata.product_event_type = "system.mfa.factor.deactivate" or
$e.metadata.product_event_type = "user.mfa.factor.deactivate" or
$e.metadata.product_event_type = "user.mfa.attempt_bypass" or
$e.metadata.product_event_type = "user.mfa.factor.reset_all"
$e.security_result.action = "ALLOW"
(
$e.security_result.detection_fields["New Device"] = "POSITIVE" or
$e.security_result.detection_fields["New IP"] = "POSITIVE" // Fine tuned the suspicous events pertatining from NEW IP address or New Device using additional Okta logs 
)
$e.principal.user.userid = $user
 

match :

$user over 15m


condition:
    $e 
}
